In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [ ]:
"""
output
person_id, name, num_friends, total_marks
"""

In [4]:
%%sql
select * from test.person;

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

   person_id   name                  email  score
0          1  Alice  alice2018@hotmail.com     88
1          2    Bob    bob2018@hotmail.com     11
2          3  Davis  davis2018@hotmail.com     27
3          4   Tara   tara2018@hotmail.com     45
4          5   John   john2018@hotmail.com     63

In [5]:
%%sql
select * from test.friend

 * mysql+mysqlconnector://tushar:***@localhost
8 rows affected.

   person_id  friend_id
0          1          2
1          1          3
2          2          1
3          2          3
4          3          5
5          4          2
6          4          3
7          4          5

In [11]:
%%sql

with marks_info as(
select f.person_id, count(*) total_friends, sum(score) as total_score from
test.friend f
join test.person p
on f.friend_id=p.person_id
group by 1 having total_score>100)
select marks_info.person_id, name, marks_info.total_friends, marks_info.total_score
from marks_info join test.person
on marks_info.person_id=person.person_id

 * mysql+mysqlconnector://tushar:***@localhost
2 rows affected.

   person_id  name  total_friends total_score
0          2   Bob              2         115
1          4  Tara              3         101

In [12]:
%%sql df_friend <<
select * from test.friend

 * mysql+mysqlconnector://tushar:***@localhost
8 rows affected.
Returning data to local variable df_friend

In [13]:
%%sql df_person <<
select * from test.person

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.
Returning data to local variable df_person

In [24]:
joined_df = pd.merge(df_friend, df_person, left_on='friend_id', right_on='person_id')
joined_df = joined_df[['person_id_x','friend_id','score']]
friends_count = joined_df.groupby('person_id_x')['friend_id'].count().reset_index()
print(friends_count)
total_score = joined_df.groupby('person_id_x')['score'].sum().reset_index()
print(total_score)

   person_id_x  friend_id
0            1          2
1            2          2
2            3          1
3            4          3
   person_id_x  score
0            1     38
1            2    115
2            3     63
3            4    101

In [28]:
final = pd.merge(df_person, friends_count, left_on='person_id', right_on=['person_id_x'])
final = pd.merge(final, total_score, left_on='person_id', right_on=['person_id_x'])
final = final[final['score_y']>100]
final[['person_id','name','friend_id','score_y']]

   person_id  name  friend_id  score_y
1          2   Bob          2      115
3          4  Tara          3      101